{"id":1598,"date":"2024-01-01T16:45:05","date_gmt":"2024-01-01T16:45:05","guid":{"rendered":"https:\/\/squarryclub.github.io\/?page_id=1598"},"modified":"2024-02-10T17:29:48","modified_gmt":"2024-02-10T17:29:48","slug":"tributes-to-fallen-squarry-members","status":"publish","type":"page","link":"https:\/\/squarryclub.github.io\/tributes-to-fallen-squarry-members\/","title":{"rendered":"Squarrites Sadly Missed"},"content":{"rendered":"\n<p><span style=\"text-decoration: underline;\"><strong>Dave (Yupmeister, Yup, Yuppy)<\/strong><\/span><br \/>Our founder, organiser and webmeister. The Squarry club was Yuppy’s passion. Yup passed away after a battle with bladder cancer and sudden deterioration in his health, on 22nd July 2023. There was a massive outpouring of love and tributes to Yup, his passing being a massive loss for many. His funeral, which had people standing in the aisles and foyer of the crematorium, took place on 17th August 2023. Yup’s family set up a Just Giving website to raise money for those affected by bladder cancer and the site will remain open until August 2028 (<a href=\"http:\/\/www.justgiving.com\/fundraising\/yupmeister\">https:\/\/www.justgiving.com\/fundraising\/yupmeister<\/a>).<\/p>\n<p>Yup enjoyed the simple things in life and even more so when he was enjoying them with his friends and family. A walk in the countryside, a pub lunch, a pint of real ale, a laugh with friends, a corny dad pun, a pork pie, a Wright’s pie… well, any pie really. A moan about Stoke City, 2 poppadoms (don’t forget the lime pickle), a peshwari nan. Yuppy went too soon and we miss him, particularly his joviality, reliability, kindness, organisational skills, and for those that did the away trips, his loud snoring! While Yup was here, he squeezed as much enjoyment out of life as he could. And we all give thanks that some of that rubbed off on us. He was a great man and a true friend to many.<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>Tim (Mothy)<\/strong><\/span><br \/>Our well loved member Tim joined the club back in the 90’s. Mothy joined the annual trips to Ireland and Scotland and subsequent, more adventurous overseas trips including the infamous escape from Colditz trip. He loved the monthly Squarry dos, and would often be seen fast asleep on the return train with a happy smile on his face. He organised walks meticulously, not only for the Squarry Club, but also for the retiree group which ran alongside. He always looked forward to the pub at the end of the walk where pies and puddings were his highlights but only after a pint or two. A pair of secateurs would appear from time to time to cut back thorny bushes overhanging stiles, and using his walking stick, he’d lift electric fence wires whilst everyone else clambered underneath. Tim was always so very easy to talk to and always had a balanced view on all topics. He was always attentive, kind and considerate. Tim touched the hearts of everyone who had known him, even if only briefly. Tim passed away on 8th July 2023 at the Royal Stoke hospital, and his funeral, which was extremely well attended, was held at Stafford Crematorium on 25th July 2023. We miss Tim terribly. He was a true Squarrite in all respects and a great friend to everyone.<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>Joe Tuohy (Mr Tahoohigh)<\/strong><\/span><br \/>Our very good friend and colleague passed away on 25th July 2017 after suffering a further stroke.  His funeral took place on Tuesday 15th August which was very well attended by Joe&#8217;s family and friends.  Joe was a very dear friend to many of us and it was always a pleasure to be in his company.  He will always be remembered for his wit, his knowledge of beer and breweries, and his old jokes. We shall all miss you Mr Tahoohigh  Sweet dreams matey.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Dave (Yupmeister, Yup, Yuppy)Our founder, organiser and webmeister. The Squarry club was Yuppy’s passion. Yup passed away after a battle with bladder cancer and sudden deterioration in his health, on 22nd July 2023. There was a massive outpouring of love &hellip; <a href=\"https:\/\/squarryclub.github.io\/tributes-to-fallen-squarry-members\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"class_list":["post-1598","page","type-page","status-publish","hentry"],"_links":{"self":[{"href":"https:\/\/squarryclub.github.io\/wp-json\/wp\/v2\/pages\/1598","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/squarryclub.github.io\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/squarryclub.github.io\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/squarryclub.github.io\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/squarryclub.github.io\/wp-json\/wp\/v2\/comments?post=1598"}],"version-history":[{"count":10,"href":"https:\/\/squarryclub.github.io\/wp-json\/wp\/v2\/pages\/1598\/revisions"}],"predecessor-version":[{"id":1654,"href":"https:\/\/squarryclub.github.io\/wp-json\/wp\/v2\/pages\/1598\/revisions\/1654"}],"wp:attachment":[{"href":"https:\/\/squarryclub.github.io\/wp-json\/wp\/v2\/media?parent=1598"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}