{"id":291,"date":"2013-06-29T20:44:50","date_gmt":"2013-06-29T20:44:50","guid":{"rendered":"http:\/\/baltibugle.co.uk\/?page_id=291"},"modified":"2016-03-31T13:05:25","modified_gmt":"2016-03-31T13:05:25","slug":"reviews-2","status":"publish","type":"page","link":"https:\/\/baltibugle.co.uk\/reviews-2\/","title":{"rendered":"Reviews"},"content":{"rendered":"<h2><span style=\"font-size: 1.5em;\">Indian Restaurant Reviews             <\/span><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-296 alignnone\" style=\"font-size: 1.5em; border: 0px;\" src=\"https:\/\/baltibugle.co.uk\/wp-content\/uploads\/2013\/06\/AN1091.gif\" alt=\"AN1091\" width=\"69\" height=\"106\" \/><\/h2>\n<p>Feel free to send in your reviews.  One squarrite, who can&#8217;t be named, left a comment <i>&#8216;Effing good breakfast&#8217;<\/i>  in a guest book in a &#8216;b&amp;b&#8217; in Ireland. That would sometimes suffice, but if you wanted to be a little more thorough then perhaps you could refer to the service, quality of food, cost, size of nans, fresh pappodoms, availability of mixed or lime pickles, decor, size of bogs? availability of draught lagers, can you take your own drinks, or even the size of rats running around the kitchen etc etc.<\/p>\n<p>I&#8217;m asked on numerous occasions what certain items on menus consist of.  Click <b><a href=\"https:\/\/www.baltibugle.co.uk\/recipes\/Yup's%20quick%20reference%20menu%20guide.htm\" target=\"_blank\">here<\/a><\/b> for a quick reference guide.  If you spot any dish not included then please let me know and I&#8217;ll add it to the list.<\/p>\n<p>&nbsp;<\/p>\n<table style=\"width: 734px;\" border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<tbody>\n<tr>\n<td valign=\"top\" width=\"201\">Akbars Manchester<\/td>\n<td valign=\"top\">Visited May 12, May 09 and Jan 09.  <span style=\"line-height: 19px;\">Large room with low ceiling creating a very noisy atmosphere. The service and set up is very professional.  A place for youngsters, party animals and the like; which is why we went!  Nans hung off supports on tables. Very good and could highly recommend.  <\/span><\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Al Frash, 186 Ladypool Road. Birmingham<\/td>\n<td valign=\"top\">Visited Aug 04.<span style=\"line-height: 19px;\">The meals were excellent.  Bill reckons it was the best he’d had since becoming a granddad.  The nan breads weren’t like dustbin lids but were wonderful anyway, particularly the peshwaris, which were coated in honey.  <\/span><\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Al Shieks Stone<\/td>\n<td valign=\"top\">Visited July 04.  Cheap and cheerful, as expected, and the food wasn’t bad either.  No complaints as far as I can remember.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Aneesa The Midway, Newcastle<\/td>\n<td valign=\"top\">Azar, the owner is always welcoming.  Curry strengths tend to be hot but all appear similar in colour.  We used to frequent this Indian often and like to think we helped it’s presence in its early days, insisting on one occasion that they pop out to the supermarket to purchase some onion chutney for us as it wasn’t on the menu.  An old favourite of the squarry club. Several years though since we last visited. Good service and value. Beware the Jalfrezi, it used to be mighty hot.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Apne, Cross St., Burton<\/td>\n<td valign=\"top\">Visited in July 2013.  <span style=\"line-height: 19px;\">Next to the Coopers Tavern who allow you to take their beer into the Apne.  The range of main courses was extensive and mouth watering.  The service was very good and efficient; so efficient in fact that we had time for Fantastica ice creams.  Now that was a first!! <\/span><\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Arena, Kidsgrove<\/td>\n<td valign=\"top\">Visited Sep 03.  <span style=\"line-height: 19px;\">Scrummy nosh as far as I recall. <\/span><\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Balti House, Nottingham<\/td>\n<td valign=\"top\">Visited in May 2013.  <span style=\"line-height: 19px;\">This is the longest established Indian in Nottingham city centre and had good reviews on tripadvisor, so should have been a good choice.  The moustached boss-man was very welcoming and recommended the party menu option as we were tight on time: this offered less choice of main courses but included popadoms and mixed starters for a usual price of £15.95, which he reduced to £13.95 for our party. Wine was ordered at the very cheap price of less than £5 a bottle, but was soon rejected by most, who changed to the Cobra.  The pops and starters went down well but the mains weren’t of very good quality and Yuppers gave the owner some feedback that may have been a little harsh. The bill came to less than £20 each, though another time we would pick a better quality restaurant as there are many to choose from in Nottingham.<\/span><\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Barajee Broad St., Birmingham<\/td>\n<td valign=\"top\">Visited March 09 and on several other occasions.  <span style=\"line-height: 19px;\">One of my favourites in Brum. Sit in a window seat overlooking the canal and Broad Street and watch the partygoers entertain you below.  Food and service is very good. <\/span><\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Barn, Marchington <a href=\"http:\/\/www.barnindian.com\/\">www.barnindian.com<\/a><\/td>\n<td valign=\"top\">Visited on the Mystery trip 2012.  <span style=\"line-height: 19px;\">Real ale bar, excellent food and service, and highly recommended. <\/span><\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Barn India,  Woore<\/td>\n<td valign=\"top\">Visited 26th April 2013.  A little bit off the beaten track, but a very pleasant restaurant situated in a converted barn, with a charming rustic entrance and cosy reception, the main dining area was light and airy which complimented the comfortable and relaxed atmosphere.  The service was very efficient and friendly, with the waiter taking time to explain the more exotic dishes on the menu, the various courses and drinks all came in timely order, despite there being twelve in our party.  All three courses were of high quality, well cooked and very tasty, with a really good choice of main meals.  We were all very happy with the food, service and value for money, possibly 9 out of 10.One other note to mention, there was also a doggy bag service which was most welcome, with Yuppy letting go of the reins somewhat this year, we digressed and indulged in a starter, needless to say some of us (I) could not finish our main meal and it went home with us (me!) Craigee 50\/50<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Bengal on the A34, near Mayne Street, Hanford<\/td>\n<td valign=\"top\">Visited shortly after opening in 2006.  Previously the Staffordshire Knot pub.  Very clean and contemporary. Excellent meals. I could recommend the Bengal Naga which was madras hot. The Bengal Rezzala was medium but contained a few green chillies.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Bengal Lodge on A34 near Darlaston, Stone.<\/td>\n<td valign=\"top\">Visited 31\/9\/06  Previously a Little Chef on the A34 near Darlaston, this Indian is remote from any worthwhile pub and could be situated anywhere, you wouldn’t know you were sitting just a few yards away from a main dual carriageway. The inside is contemporary and spotlessly clean. The food is well presented and the service excellent. Drinks were provided on the house after the meal which cost £45 for 2 including starters and wine. The pappodoms and accompaniments were almost the best ever and the peshwari nan breads, lightly covered with honey were scrumptious. The onion bhajis were disappointing. The main courses were good. Roses were handed to the ladies at the end of the meal.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Bilash, Higherland, Newcastle, Staffs<\/td>\n<td valign=\"top\">Visited <a href=\"https:\/\/baltibugle.co.uk\/reviews\/Bilash\/Bilash.htm\" target=\"_blank\">19th Feb 2005<\/a> and on several other occasions.  Always been a favourite of mine. Licensed, reliable, great food and good service.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Bilash, opposite the Civic Halls, Wolverhampton.<\/td>\n<td valign=\"top\">Visited Spring 2006 by Ali G.  Trendy city centre location, extremely handy for the civic halls, modern décor within and comfortable.Service excellent, nothing too much trouble without being pushy or hurried, and extremely polite.  Given the above, the food had something to live up to and it did not disappoint, from the pickles etc that came with the popadoms, through to the main courses.  The food was of a very very high standard.  Don’t go here though and expect your £6.95 special, expect food of very high quality and expect to pay a fair price for it.  Highly recommended and Ten out of Ten by Ali G<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Bolaka Spice Leek.<\/td>\n<td valign=\"top\">Visited April 09 and on several other occasionsJacob’s Creek and a few cobras quickly provided within the first ten minutes.  The food and service was excellent.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Bon O Phool Congleton<\/td>\n<td valign=\"top\">Visited June 07.  Luckily for the natives, we were ushered upstairs into a self contained room.  Kingfisher and Cobras available. Very good food and service particularly as we were a large birthday gathering.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Brindleys Stone<\/td>\n<td valign=\"top\">Squarry Cruise – June 05.  Our first ever bargee trip on the Aquarius. As a one off they provided us with Indian food and real ale. Fantastic service in such a confined space.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Chamin Indian Sheffield<\/td>\n<td valign=\"top\">Visited July 11Restaurant upstairs. <a href=\"http:\/\/www.chaman.co.uk\/\">www.chaman.co.uk<\/a> . The quality of the food was excellent and unbelievably cheap. Took our own drinks.  A very nice lady also looked after us making us feel very welcome.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Chandni Cottage, Burslem<\/td>\n<td valign=\"top\">Visited 2nd April 04.  Fairly good feedback from the squarrites.  Not expensive and reasonable food and service.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Chillis The Midway, Newcastle<\/td>\n<td valign=\"top\">Small but friendly indian with excellent food and a wide choice before Dill, the owner (previously a chef at Koh i noor), left in 2008 and joined Jalsa Tandoori in George Street.Renamed Clove in 2013.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Chutneys Brick Lane, London<\/td>\n<td valign=\"top\">Visited Oct 08.  A 25% discount on the food order, 2 bottles of house wine, and a free pint for everyone was negotiated.  Sadly some of the meals were served luke warm and had to be returned to the microwaves.  Still, the wine was good so I was reliably informed by Keithee.Visited Nov 07 when a free pint of Cobra for everyone, 30% off our bill and a couple of bottles of red wine was negotiated. Best offer we’ve ever had I believe.  The meals and drinks were fine from memory<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Eastern Spices, Sandbach<\/td>\n<td valign=\"top\">Visited March 2013.  Small in size but has a good reputation of providing a fine range of tasty meals. The service was good; meals and drinks were good and the bill was very reasonable.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">East is East Indian, Charles St., Manchester<\/td>\n<td valign=\"top\">Visited Jan 10.  Voted the best restaurant in at the Food &amp; Drink Awards in 2007, and was only a 10 to 15 minutes walk from the railway station (<a href=\"http:\/\/www.eastzeast.com\/manchester-ibis.asp\">http:\/\/www.eastzeast.com\/manchester-ibis.asp<\/a>).  The restaurant lived up to its expectations and excellent feedback was received from most of the group.  The final bill including drinks was around £20 proving excellent value for money.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Eurasia, Bridgnorth, Shropshire<\/td>\n<td valign=\"top\">Visited as a group of 26 on 24th June to celebrate Yuppy&#8217;s birthday. 59 again!!  The service and food was brilliant. Marks of 10 out of 10 were left on the bugle card. Check out their facebook page and you will see the rave reviews and also a photo of the cake in a balti dish, made by Zolette, and presented by the staff. Highly recommended restaurant. The staff are exceedingly friendly and the food is spot on.   <a href=\"http:\/\/www.eurasiatandoori.com\/index.html\" target=\"_blank\">www.eurasiatandoori.com\/index.html<\/a><\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">‘4550 miles from Delhi’ Nottingham<\/td>\n<td valign=\"top\">Visited May 08.  We opted for the banquet at a special discounted rate of £17.  The food was good and plentiful with endless supplies being provided.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Gate of India, Chester<\/td>\n<td valign=\"top\">Visited July 09.  Excellent service, tremendous birianis (ask Spike), and fantastic value.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Golden Oven Bateman Street, Soho, London<\/td>\n<td valign=\"top\">Visited Nov 10.  The meal was average, particularly the recommended kebabs, but when the bill arrived there was a sheer look of horror on one or two faces as the prices of the drinks, in particular the wine, had inflated the total cost.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Hannahs Butt Lane, Talke<\/td>\n<td valign=\"top\">Visited May 05.  Once the Mecca bingo hall’ of Kidsgrove the dining area is huge as you’d expect.  A buffet style meal.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">India Cottage, Burslem<\/td>\n<td valign=\"top\">Visited March 08.  The feedback on the meal and service at the Indian was excellent.  Food ratings have since dropped to 1 out of 5 so check it out. May have improved by now (March 2016)<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Indian Ocean, Nantwich<\/td>\n<td valign=\"top\">Visited July 07.  Only one toilet available although many take advantage of the ladies. The meal was excellent and most cleared their plates, having avoided starters.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Indian Palace, Kohinoor and Moharaja Vilamoura, The Algarve<\/td>\n<td valign=\"top\">Kohinoor just nicked it. <a href=\"https:\/\/www.baltibugle.co.uk\/reviews\/Vilamoura\/Review%20of%20Indian%20Palace%20etc.htm\" target=\"_blank\">August 2005<\/a><\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Indian Spice, Alsager<\/td>\n<td valign=\"top\">Visited July 10.  The meals at the Indian Spice were excellent, as was the wine.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Jaipur Indian Restaurant, Market Drayton<\/td>\n<td valign=\"top\">Mystery Christmas Bash – Dec 05.  Unfortunately, and as is occasionally the case with groups of this size, one or two had to wait longer than most and sadly a war of words broke out in some quarters   On the whole, the meal was excellent and great value for money at around £15 each, and the Indian would welcome most of us back.Upstairs room available for parties up to approx 33. Licensed. Amazing value for money and great service. Extensive menu, one of the longest I’ve seen, but the toilet is the smallest I’ve ever seen. Try a sambuca after your meal.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Jalsa, Newcastle George StreetTel 01782 611551<\/td>\n<td valign=\"top\">General comments:  Opened early 2006. Very popular, so book early. Spotless. Staff are normally very efficient and the food is generally excellent. Contemporary but comfortable surroundings, licensed (but only till 11pm – beware) and slightly expensive, but then you pay for quality. Dill (from Chillies) joined in the summer of 2008 and has already boosted its popularity status with the squarry club.  Visited April 06 &#8211; The food was excellent and commended by all.  Crafty, not yet converted to real ale, also commended the lager.Visited May 08 &#8211; The service was slow, the poppodoms were late, and Yup’s curry had to be sent back to the kitchen to be replaced with the one he’d ordered.  Craigee had more chillies than he could handle.  All in all, a fairly good meal, but with poor service the tip was reduced accordingly,<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Jimmy Spices, Birmingham<\/td>\n<td valign=\"top\"> Visited June 2013<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Koh-I-noor Newcastle<\/td>\n<td valign=\"top\">General comments:  Traditional. Licensed. Probably the first indian to open in Newcastle. Excellent food and service. Toilets upstairs are average. Dated but comfortable. Not returned since about 2005.Visited July 03 &#8211; The oldest Indian in Newcastle.  The Kooi staff welcomed us with open arms.  The food was excellent and prepared to a very high standard.  The choices were extensive, including chilli rice which was very hot.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Lal Haweli Rusholme, Manchester<\/td>\n<td valign=\"top\">Visited Jan 07. Chosen after advice from a couple of passers by.  Wine and Cobra on draft available.  The food and service was excellent and the explanation of the difference between the peshwari and the rashmi nan breads made no sense at all at the time.  We would return however.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">London House Balti, Eccleshall<\/td>\n<td valign=\"top\">Visited June 09<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Malibar Water St., Stafford<\/td>\n<td valign=\"top\">Visited May 11, July 08 and Sep 06.  The service and food were superb.  The ‘fairly hot’ Rezela tarkari is spot on.  All were impressed, especially Moonbeam who finished every last grain of rice before allowing the waiter to take his plate away at the third attempt.Pappodoms were served immediately and the main courses, which had been previously been pre-ordered were bought out soon after. The service and food were superb. My ‘fairly hot’ Rezela tarkari was spot on.All were impressed, especially Moonbeam who finished every last grain of rice before allowing the waiter to take his plate away at the third attempt. (Reviewed Sep 2006. Check out the Blast from the Past..)<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Mango Tree, Hanley<\/td>\n<td valign=\"top\">Visited March 07.  As we expected, we were informed that our booked table wasn’t quite ready when we got to the Mango Tree, and that we would have to wait in the lounge and buy extortionately priced drinks whilst the table was prepared.  A clever ploy by many restaurants these days.  The help-yourself buffet was however plentiful and pretty tasty.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Masala Art Indian 6 Midland Rd., Derby<\/td>\n<td valign=\"top\">Visited June 07.  The interior of the Masala Art was tasty, as were the meals which were served in brass pots. The final bill however, was a shocker, at £25 a head, being amongst the highest we’d ever paid.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Masala Zone Indian, Covent Garden<\/td>\n<td valign=\"top\">Visited Nov 09. The food was bought out on large silver trays,with the food shrinking into oblivion in the middle. Disappointing quantities.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Mason Masala, Butt Lane,Talke<\/td>\n<td valign=\"top\">Visited Jan 06. Very good from memory. I recall a step which we fell down a few times. Opened in 2005. Contemporary feel, particularly in conservatory at rear. Licensed.  Average food, good service but on the slow side.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Moments Windmill Hill, Rough Close, Stoke on Trent. ST3 7PG (01782) 397777<\/td>\n<td valign=\"top\">Visited 11th Feb 05 by Dasher. Only one review so far, by Dasher, and not yet visited by the club. A good contender for a future visit.Went to ‘Moments’ on Friday last (formerly the Mexican Tapas restaurant) at Meir Heath, where we had a small but perfectly formed Korma. Probably, not to the strength and quantity for your die-hard curry members, but as a starter to compare with others it was tasty, but not overwhelming.Very ‘upmarket’ surroundings; service was good if slightly rushed (we’d only just been shown to our table, when we being asked for our drinks order!). I suspect it was as much to do with the need to ‘turn over’ tables, as it was good service, given that it was full. Parking limited – used Windmill opposite.Cost – slightly more than elsewhere with smaller portions. Nan bread lovely – light and tasty whether garlic or peshwari. Bogs – didn’t use. Licensed bar – had £10.90\/house wine. Rats – none.Dasher<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Monsoon Brick lane,  London<\/td>\n<td valign=\"top\">Visited Nov 12<a href=\"http:\/\/www.monsoonatbricklane.co.uk\/\" target=\"_blank\"> www.monsoonatbricklane.co.uk<\/a>  Highly recommended for value and quality of food.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Mughal Tutbury.<\/td>\n<td valign=\"top\">Visited Dec 08  AND NEVER AGAINAn impressive entrance with murals adorning the walls, and a river literally running along the floor, following a water burst.  There was consequently no heating and the central fountain was out of commission.  Unsurprisingly, there was no-one else in the restaurant.  Several trips were attempted to the toilets, where the ‘checked every half an hour’ board was last signed off in 1752 by Sir John Vernon of Sudbury. There was no wine available and meals were served in dribs and drabs.  Patience wore thin as an eternity passed before the first few meals were bought out and placed on an adjacent table to chill before being distributed.  Some of the rices were handed out, some of which were frozen, and several other dishes passed around haphazardly in an attempt to appease us.  In all, the service was atrocious and by far the worst ever meal and service experienced by the squarry club.  A bill of several hundred was instantly dismissed and eventually a fiver a head was accepted as a take it or leave it final offer to cover everything.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Naaz Tandoori and Balti, Pillory St., Nantwich<\/td>\n<td valign=\"top\">Visited March 05.  Naaz’s is a trad Indian.   Not the best curry, but ok.  Probably wouldn’t return here in the near future.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Nawaabs, Huddersfield<\/td>\n<td valign=\"top\">Visited by Yupmeister and Mrs Yupmeister on 27\/8\/05.  Our visit to Nawaabs was made even more enjoyable by a taxi ride in Mr B’s taxi (no 24). ‘You ask for me, Mr B’, he repeated. So we did.The restaurant was buzzing. A couple of parties were in and there was some pretty loud music playing in the background. Luckily the hotel we were staying in had made our booking, otherwise I doubt if we’d got in. It was bulging to bursting. We sat talking to some locals in the bar area before the meal who had been using the restaurant for over 13 years and praised the quality and the staff before leaving. The Nawaabs is part of an international chain, there’s also one in Leeds, Bradford and Manchester evidently. They recommended lamb chops for starters ….. so we went along with it.Top marks to the quality of the food. Baltis are presented in a small balti dish and are much drier than the stokey baltis. They are however, very tasty. We shared a Nirali special and the chicken badami with the obligatory peshwari nan bread and pilau rice. Couldn’t fault anything really except the waiters, who were a bit reserved you might say, but very efficient. No photo of the bogs cus I didn’t have my camera, but they were above average condition.  A large mirror adorned the far wall making the place appear bigger than it was, but giving a bigger panoramic view for anyone sitting facing the wall. The prices were reasonable; £40 total for two including the bottles of merlot and cobra. Shame it’s too far out for an evenings trip, or is it? Yupmeister (and Mrs Yupmeister)  <a href=\"http:\/\/nawaab.net\/\">http:\/\/nawaab.net\/<\/a>    Huddersfield and Leeds    Tel 01484 422775<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Nazmins, Burslem<\/td>\n<td valign=\"top\">Visited Jan 11The feedback on the food was pretty good and at £15 including cobras you couldn’t grumble.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The New Monsoon, or the PlaceBottomhouse, near Leek<\/td>\n<td valign=\"top\">Mystery – Dec 06. Just 5 minutes from the famous Yew Tree Inn.  A fine selection of starters including samosas, kebabs and a pappodom basket were served within minutes and drinks orders were taken by the enthusiastic young waitresses.  Great room for a big party and excellent food.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">New Royal Balti, Audley<\/td>\n<td valign=\"top\">Visited several times between 2003-2010. Time keeping of bookings not the best, but not a problem if you’ve got time to slip across the road to the Butchers Arms. Excellent baltis though and one of our favourites. Happy and comical waiters. Great value and you can take your own drinks, purchased from the local offies.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The New Zalyqa, Howard Place, Stoke<\/td>\n<td valign=\"top\">Visited 8th May 04.  The food was reasonable and drinks could be bought in with kind permission of the Norfolk Pub next door.  The peshwari nan was slightly soft and doughy in parts, the baltis were average but the rices were good.  The chilli tikka massalla balti contained sufficient chillies to keep me going, A tenner covered the meal.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Ovilash, Radford St. Stone<\/td>\n<td valign=\"top\">Visited July 06A relatively new Indian in 2006, replacing a Mexican restaurant.The meal was pretty average when it finally arrived and I don’t think we’ll be returning.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">A Passage to India, Bold Street,  Liverpool<\/td>\n<td valign=\"top\">Visited  Feb 13, April 10 and August 07.  To be fair this is the only Indian restaurant we’ve tried in Liverpool. There may well be other good ones about but this is convenient and has always been good value, with good service and food.The Bangla, a pumpkin curry, was particularly scrummy.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Prachee, Keele<\/td>\n<td valign=\"top\">Visited Dec 09.  The Prachee meaning ‘eastern’ in Bengali, is set in an unusual setting overlooking the golf course.The delivery was exceedingly slow. In dribs and drabs, and balti dishes, the food gradually emerged. First the main meal, and a while later a rice, if you were lucky. Occasionally a nan would appear. The food was good but could have been so much better if it had been served in its entirety over a short period.  Hopefully not ‘par for the course’ !!  Now closed (March 2016)<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Quarma,  Leek<\/td>\n<td valign=\"top\">Visited July 12.  &#8216;One of the best ever&#8217; say several squarrites.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Raj, 40 Park Green,Macclesfield<\/td>\n<td valign=\"top\">Visited Oct 06.  The food and service was good, but the wine tasting was even better.Beardee was heard to say his meal was ‘really, really tasty’ and ‘it’s very nice I must admit’.  The bill worked out to around £18 a head, including the spilt wine<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Raj, 40 Park Green, Macclesfield<\/td>\n<td valign=\"top\">Visited on 17th November 2006.  Excellent service when 20 of us descended on them. Helpful and friendly waiter. Decor is basic. Check out the Blast from the Past.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Raja, Riga city centre<\/td>\n<td valign=\"top\">Visited Oct 2006.  Good atmosphere and ambience based in a cellar. The staff were friendly but service was really slow. The chicken was rubbery and the nan breads, keema and peshwari, tasted the same. Licenced. Not recommended.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Rose of Kashmir, Clayton<\/td>\n<td valign=\"top\">Visited June 25th 04, March 13 and on several other occasions.  A cosy little place set within a housing estate with adjacent shops, and more especially an off licence.Takeaways can be ordered online at <a title=\"The Rose of Kashmir, Clayton\" href=\"https:\/\/baltibugle.co.uk\/reviews-2\/www.theoriginalroseofkashmir.co.uk\" target=\"_blank\">www.theoriginalroseofkashmir.co.uk<\/a>  Not connected any more to the Rose in Stoke.  The Clayton restaurant was the first of the two to open,  Only one toilet which can be busy when groups turn up at the same time.Mo and his assistants make you feel very welcome ‘Ayup, here’s trouble’ and suggesting extra hot chillies with everything ordered.  The food is always top nosh and served piping hot.  Unlicensed so take your own drinks or purchase next door.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Rose of Kashmir, Stoke<\/td>\n<td valign=\"top\">Visited on several occasions including Jan 05 and Oct 04.  Modern with artistic hand painted walls and was extended in 2004.  Sadly this restaurant has become a free for all buffet type place, although you can avoid the scrambles and order off the menu.  Generally very good food and service, and licensed. Chicken tikka and hot chillie nan breads produced by request were excellent.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Rosin, Forsbrook<\/td>\n<td valign=\"top\">Visited Jan 12<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Roti, High Street, Biddulph<\/td>\n<td valign=\"top\">Visited April 11.  An impressive, contemporary, open and bright restaurant, directly opposite Wethers. We were led to a raised area over which one or two to came a cropper. Beware the step. The toilets were upstairs.£9.95 for 3 course deal with the final bill being £17 including wine and beers. Biddulph has at least got something right.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Royal Al Faisal, Stoney Lane, Brum.   Within the Balti triangle as it’s known locally.<\/td>\n<td valign=\"top\">Visited 14th Nov 03.  Not licensed but nearby offie.  A self serve buffet from brass spacecraft-like vessels for £8, satisfied all our hungers, even Stubby, who began with the lamb sag, then the Tandoori chicken, the papodoms, the samosas, the nan breads, chicken balti, chicken tikka massalla ………………….and several others too numerous to remember.  And that was just for starters.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The New Royal Balti, Audley<\/td>\n<td valign=\"top\">Visited several times: Feb 10, Feb 09, Feb 08, Feb 07, Feb 06, Nov 04 and Oct 03.Not licensed but 2 off licences next door.  Watch out for the mischievous waiter who is generally on great form, as is the food.  Generally the service and food is excellent.  ‘The nan breads are exquisite’, according to JayCee as he recalled the thrill of rolling the biggest cherry ever around his mouth. Final bill around £15 each.  Recently been informed that its score has dropped to 1 out of 5 and the water has since left.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Royal Naz, Rusholme, Manchester<\/td>\n<td valign=\"top\">Visited July 05.  Not the best choice unfortunately.  The pappodoms were served in an instant though along with house wines.  Beardee’s curry was ‘off’ allegedly.  The head waiter went to extreme lengths in explaining how it may have been affected by spices during cooking and even bought out some examples of fresh meat on a tray to back up his explanation.  Not swayed, Beardee left his curry.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Ruchi, Abbotts Bromley<\/td>\n<td valign=\"top\">Visited Dec 07.  Previously The Royal Oak pub, until around 2006.  Now building up a good reputation in the area. Excellent food and service. Formerly a pub with real ale which is a pity. Very accommodating and friendly.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Sanjoys Indian Cuisine, ST Petersgate, Stockport. SK1 1DH  (0161 476 2077)<\/td>\n<td valign=\"top\">Visited April 07.  The restaurant had an open kitchen to one side with 3 cheeky looking chefs peering out from time to time.  The waiters were most cheerful and obliged in taking a group photo.Visited again in Sep 08 &#8211; Jacko&#8217;s and Yup&#8217;s main courses were forgotten.  2 meals were quickly provided which tasted as though they had been quickly thrown together to make up for lost time.  They weren’t worth waiting for unfortunately, and left a sour taste in our mouths.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Staffers, Dresden<\/td>\n<td valign=\"top\">Visited Feb 05.  Opened 03\/04. Very popular. Licensed. Good pub across the road with award winning garden.The food was served in Churchill’s best on a spotlessly clean whiter than white table cloth. The general consensus was that the restaurant was impressive and the grub was excellent.  Thai food was also available and Bill was tempted into having the Thai beef red curry which he claimed was another first.  The nans were served cut in half and were a reasonable size and extremely tasty.  No complaints from our end and there are intentions to return soon with families. The toilets were upstairs so I didn’t bother. I understand it now sells indian food only?<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Staffers, Shelton<\/td>\n<td valign=\"top\">Visited June 11.  Note – Under a new name and management yet again in Jan 13.  Once known as The Elms technical college, it was transformed into a restaurant many years ago becoming The Elms Restaurant and more recently Shaffers.  Several rooms are available.  The waiter was very patient and was on top of the game in sorting us out, even giving us the choice of the food being served in balti dishes or on plates. Armed with discount vouchers from the ‘thisisstaffordshire’ website we disagreed with the waiter when the final bill was presented, but we finally resolved the issue. Excellent food.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Shalimar, Midland Rd., Derby<\/td>\n<td valign=\"top\">Visited March 06.  The attention and hospitality at the Shalimar was second to none; especially after Keithee explained we’d be putting a review on the website!  Imran, our friendly waiter, attended to our every need and didn’t laugh too loud when a couple of steaks were ordered by the ‘sat-nabs’.  Visited again in Feb 11Pedro’s meal, a biriani with egg and pineapples, did look appetising. However, the meals were served lukewarm, and in addition, despite the brandies and sambuccas, the final bill proved to be very expensive. Mid week Tone sorted the bill out in Keithee’s absence and managed to get a £1 reduction after some discussions with the owner. So, we definitely wouldn’t return to the Shalimar.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Shamble, Knutsford<\/td>\n<td valign=\"top\">Visited on the Mystery Christmas Night Dec 04 &#8211; The Indian was only one of two in Knutsford. The quality of the food and service was good although the décor and size of bog could be better. Delays were inevitable, and always will be, when a group of 30 descend on a restaurant.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Shezans, Ford Green Rd<\/td>\n<td valign=\"top\">Visited Jan 04.  The same dishcloth that is used in Harry’s Bar in Stoke must have been used to clean the tables.  It was nigh impossible to rearrange a plate or cutlery without using a jackhammer first to pry them off the table.Shezans it could be argued is an improvement on the Old Indiana Jones.  Now providing a buffet type service only, the extensive spread of meals are arranged in heated pods, like you’d see in a space movie.  Virtually everything was piping hot and available, except for the onion bahjis which ran out for a short time.  From kurmas to madras’s, the selection was excellent; and you could always finish off if you had room with rice pudding, fruit salad or a slice of Calcutta gateaux.  The final bill was just £9.95 a head.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Shimla Pink, Manchester<\/td>\n<td valign=\"top\">Visited April 29th 2003.  A very classy establishment, the ‘Shimla Pink’ with solid tables and walls that changed colour.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Spice of Lyefe, Lye<\/td>\n<td valign=\"top\">Visited June 2010.  Abdul was very welcoming.  Not licensed but nearby offices.  The nans were hugemongous.I can’t lye, it was, overall, an excellent meal with great service.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Star of India 154, Old Brompton Road, South Kensington, London Tel 0207 3732901<\/td>\n<td valign=\"top\">Visited by Yup and Mrs Yup on 17th February 2005.  Sadly, Reza, the chef and star from Delhi Belly (UK TV), wasn’t resident at the restaurant when we popped in, just a few grumpy waiters. The restaurant was packed with diners, so it was a good job we’d booked a table several weeks earlier.Reza’s can be found on Old Brompton Road, about ½ a mile west of the South Kensington underground station, and is surrounded by several other restaurants and pubs. We were shown to a smaller quieter room at the rear of the main dining area on the ground floor, only big enough for 4 small tables. I didn’t want a fuss making over my appearance. An upstairs room was also available which I later discovered was almost as big as downstairs and had its own bar.  The service was pretty efficient, but the waiters appeared grumpy and hardly uttered a word as they took the orders and served the meals. Evidently, one of them was polite and even smiled when I later slipped off to the boy’s room.We skipped the starters and went for the traditional pappodoms and chutney tray. Both were presented extremely fresh, just as you’d hope for and gave us reassurance that the trip had been worthwhile. I wish now we’d have tried a starter cus they looked really tasty and unusual, unlike the usual common starters you get at most places.The main courses we chose were Murg Khumb Bahar and Murg Tikka Zafrani; the first one mainly consisting of chicken, mushrooms and cashew nuts, and mine consisting of chicken and chillies. A chillie nan and a peshwari rice completed the order along with a bottle of red wine at around 12 quid. The total bill came to just under £50. They wouldn’t give me a menu for future reference so this <a href=\"https:\/\/baltibugle.co.uk\/reviews\/Rezas\/menu%20only.htm\" target=\"_blank\">menu <\/a>is from memory only.The décor was unusual with ornately painted ceilings. A couple behind us were having a right argee bargee with each other which made interesting listening.The food was excellent and we will definitely be going back. Not huge helpings, but just right and the quality was excellent. (Shame about the waiters.) Mr &amp; Mrs Yup.  Obviously more expensive than most but well worth a visit.A squarry visit was finally made by the Squarrites in Nov 2011.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">Taste of India, Poseidonos Ave., Aliathon Hotel, Shopping Centre, Paphos,Cyprus<\/td>\n<td valign=\"top\">Visited August 08. Excellent food and service. Returned again to see if quality was as good as the first time, and we weren’t disappointed. Best in area.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Taste of Paradise, Newport<\/td>\n<td valign=\"top\">Visited Dec 10.  Looks like a carpet warehouse building down an alleyway.  A buffet meal was set up for us following platters of mixed starters, and poppodoms comprising chicken tikka masala, chicken tikka, jalfrezi, lamb dupiaza and chicken bhuna; with rices and a variety of nan breads. Beer and wine had been previously delivered, as the restaurant is unlicensed, and all seemed to go down well. Well done to everyone at the ‘Taste’.  An excellent night.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">2 Angels, Newcastle.  1-2 Andrew Place<\/td>\n<td valign=\"top\">Visited April 05.  Abysmal service on our visit on 29th April 05 but possibly a one off. Food very good though. Licensed. Clean. Take-away service recommended and on time !! Changed ownership in 2012\/2013.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Vernon Yonge Arms, Croxton<\/td>\n<td valign=\"top\">Visited in Dec 11 on the Mystery.  Separate bar with a real ale. Large room with excellent food and service.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Viceroy, Derby<\/td>\n<td valign=\"top\">Visited Feb 12.  Very swish inside contemporary with large pictures and multicoloured lighting. The quality of food was described as one of the best ever by several of the group. Fresh, crisp poppodoms were promptly bought to the table after our order. Fair and tasty portions of chutneys. Nans were cut into quarters to save having to rip them apart.Large bottles of Cobra were around a fiver each with wine being too expensive starting at around £18. The 2 for 1 main course deal is well worth taking advantage of if you can vacate the table by around 7.30pm. Very good service and an abundance of waiters in full dress.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"201\">The Vine, West Brom<\/td>\n<td valign=\"top\">Visited March 11.  Crossing the M5 we located Roebuck Street and followed the map down to the Vine. Unless you had a map or knew where it was you would easily miss it.  A hidden gem within an industrial estate.2 large rooms and smaller snugs with large bbq to the rear. There were specials, standard curries and BBQ’s available, clay pots and tin pots, and real ale\/guest beers at the bar. What more could a man want.The BBQ’s were £3.50 whilst the main dishes including rices and nan were a bargain at around £7.50. There were all types of meat available, but when asked if we wanted goat curry, well, ‘you’ve got to be kidding’, someone bleated.Several went for the bbq’d hot chicken tikka masalla, which lived up well to its description, and then a honey and chillie chicken main at £4.25, with rice and nan at around an extra couple of quid each. There was no final bill to settle up as you paid for your meal when ordering.  The route to Kendrick Park metro station, about 10 minutes away was a poorly lit area. I wouldn’t recommend this route if you hadn’t got Granpop Bill with you.<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Indian Restaurant Reviews              Feel free to send in your reviews.  One squarrite, who can&#8217;t be named, left a comment &#8216;Effing good breakfast&#8217;  in a guest book in a &#8216;b&amp;b&#8217; in Ireland. That would sometimes suffice, but &hellip; <a href=\"https:\/\/baltibugle.co.uk\/reviews-2\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":8,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"class_list":["post-291","page","type-page","status-publish","hentry"],"_links":{"self":[{"href":"https:\/\/baltibugle.co.uk\/wp-json\/wp\/v2\/pages\/291","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/baltibugle.co.uk\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/baltibugle.co.uk\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/baltibugle.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/baltibugle.co.uk\/wp-json\/wp\/v2\/comments?post=291"}],"version-history":[{"count":33,"href":"https:\/\/baltibugle.co.uk\/wp-json\/wp\/v2\/pages\/291\/revisions"}],"predecessor-version":[{"id":855,"href":"https:\/\/baltibugle.co.uk\/wp-json\/wp\/v2\/pages\/291\/revisions\/855"}],"wp:attachment":[{"href":"https:\/\/baltibugle.co.uk\/wp-json\/wp\/v2\/media?parent=291"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}